In [2]:
import pandas as pd
import numpy as np

In [4]:
products_df = pd.DataFrame({
'Product_ID': [1, 2, 3],
'Product_Name': ['iPhone 12', 'Samsung S21', 'Pixel 5'],
'Product_Price': [999, 899, 699],
})
sales_df = pd.DataFrame({
'Sale_ID': [1, 2, 3, 4, 5, 6, 7],
'Sale_Date': pd.to_datetime(['2021-01-01', '2021-02-01', '2021-02-15', '2020-03-01', '2020-04-01',
'2020-02-15', '2020-01-01']),
'Customer_ID': [1, 2, 3, 2, 3, 4, 4],
'Product_ID': [1, 1, 2, 2, 3, 3, 1],
})
customers_df = pd.DataFrame({
'Customer_ID': [1, 2, 3, 4],
'Customer_Name': ['John Doe', 'Jane Doe', 'Jim Brown', 'Jake Smith'],
'Customer_Age': [25, 30, 35, 20],
'Customer_Email': ['john@doe.com', 'jane@doe.com', 'jim@brown.com', 'jake@smith.com'],
})

**For each product calculate the number of customers that bought it and their average age
For example → For product ‘iPhone’ customer count was: 2 and average customer age was: 25**

In [9]:
products_df

   Product_ID Product_Name  Product_Price
0           1    iPhone 12            999
1           2  Samsung S21            899
2           3      Pixel 5            699

In [11]:
sales_df

   Sale_ID  Sale_Date  Customer_ID  Product_ID
0        1 2021-01-01            1           1
1        2 2021-02-01            2           1
2        3 2021-02-15            3           2
3        4 2020-03-01            2           2
4        5 2020-04-01            3           3
5        6 2020-02-15            4           3
6        7 2020-01-01            4           1

In [14]:
customers_df

   Customer_ID Customer_Name  Customer_Age  Customer_Email
0            1      John Doe            25    john@doe.com
1            2      Jane Doe            30    jane@doe.com
2            3     Jim Brown            35   jim@brown.com
3            4    Jake Smith            20  jake@smith.com

In [26]:
merge = pd.merge(products_df, sales_df, on="Product_ID")

In [28]:
merge

   Product_ID Product_Name  Product_Price  Sale_ID  Sale_Date  Customer_ID
0           1    iPhone 12            999        1 2021-01-01            1
1           1    iPhone 12            999        2 2021-02-01            2
2           1    iPhone 12            999        7 2020-01-01            4
3           2  Samsung S21            899        3 2021-02-15            3
4           2  Samsung S21            899        4 2020-03-01            2
5           3      Pixel 5            699        5 2020-04-01            3
6           3      Pixel 5            699        6 2020-02-15            4

In [30]:
super_merge = pd.merge(merge, customers_df, on='Customer_ID')

In [32]:
super_merge

,Product_ID,Product_Name,Product_Price,Sale_ID,Sale_Date,Customer_ID,Customer_Name,Customer_Age,Customer_Email
0,1,iPhone 12,999,1,2021-01-01,1,John Doe,25,john@doe.com
1,1,iPhone 12,999,2,2021-02-01,2,Jane Doe,30,jane@doe.com
2,1,iPhone 12,999,7,2020-01-01,4,Jake Smith,20,jake@smith.com
3,2,Samsung S21,899,3,2021-02-15,3,Jim Brown,35,jim@brown.com
4,2,Samsung S21,899,4,2020-03-01,2,Jane Doe,30,jane@doe.com
5,3,Pixel 5,699,5,2020-04-01,3,Jim Brown,35,jim@brown.com
6,3,Pixel 5,699,6,2020-02-15,4,Jake Smith,20,jake@smith.com

In [54]:
super_merge.groupby('Product_Name')['Customer_Age'].mean()

Product_Name
Pixel 5        27.5
Samsung S21    32.5
iPhone 12      25.0
Name: Customer_Age, dtype: float64

In [46]:
super_merge.groupby('Product_Name')['Sale_ID'].count()

Product_Name
Pixel 5        2
Samsung S21    2
iPhone 12      3
Name: Sale_ID, dtype: int64

In [66]:
products_customer_sales = super_merge.groupby("Product_Name").agg(
    customer_count = ("Customer_ID", "count"),
    mean_age = ("Customer_Age","mean")
)
products_customer_sales

              customer_count  mean_age
Product_Name
Pixel 5                    2      27.5
Samsung S21                2      32.5
iPhone 12                  3      25.0

**For each year calculate the total sales for each product for that year
For example → For year ‘2020’, for product ‘iPhone’ the number of sales was 1**

In [86]:
super_merge['Sale_Date'] = pd.to_datetime(super_merge['Sale_Date'])

In [75]:
super_merge['Sale_Date'] = datetime_sale_date

In [90]:
type(super_merge['Sale_Date'])

pandas.core.series.Series

In [94]:
super_duper_merge = super_merge.copy()

In [96]:
super_duper_merge.set_index("Sale_Date", inplace=True)

In [193]:
total_sales = super_duper_merge.resample(rule='YE')['Product_Name'].count()

In [195]:
super_merge.groupby(['Product_Name', total_sales]).count()

Empty DataFrame
Columns: [Product_ID, Product_Price, Sale_ID, Sale_Date, Customer_ID, Customer_Name, Customer_Age, Customer_Email]
Index: []

In [102]:
super_duper_merge

,Product_ID,Product_Name,Product_Price,Sale_ID,Customer_ID,Customer_Name,Customer_Age,Customer_Email
Sale_Date,,,,,,,,
2021-01-01,1,iPhone 12,999,1,1,John Doe,25,john@doe.com
2021-02-01,1,iPhone 12,999,2,2,Jane Doe,30,jane@doe.com
2020-01-01,1,iPhone 12,999,7,4,Jake Smith,20,jake@smith.com
2021-02-15,2,Samsung S21,899,3,3,Jim Brown,35,jim@brown.com
2020-03-01,2,Samsung S21,899,4,2,Jane Doe,30,jane@doe.com
2020-04-01,3,Pixel 5,699,5,3,Jim Brown,35,jim@brown.com
2020-02-15,3,Pixel 5,699,6,4,Jake Smith,20,jake@smith.com

In [183]:
total_sales

Sale_Date
2020-12-31    4
2021-12-31    3
Freq: YE-DEC, Name: Product_Name, dtype: int64

In [119]:
hell = super_duper_merge.resample(rule='YE')["Sale_ID"]

In [133]:
hell

In [131]:
super_merge[super_merge["Sale_Date"].isin([2020,2021])].groupby(["Product_Name","Sale_Date"]).sum(numeric_only=True)

Empty DataFrame
Columns: [Product_ID, Product_Price, Sale_ID, Customer_ID, Customer_Age]
Index: []

In [157]:
super_merge['Sale_Date']

0   2021-01-01
1   2021-02-01
2   2020-01-01
3   2021-02-15
4   2020-03-01
5   2020-04-01
6   2020-02-15
Name: Sale_Date, dtype: datetime64[ns]

In [155]:
year_cel = super_merge.groupby(["Product_Name","Sale_Date".strftime("%Y")]).count()
year_cel

AttributeError: 'str' object has no attribute 'strftime'

In [199]:
new_format = pd.to_datetime(super_merge["Sale_Date"])
new_new_format = new_format.dt.strftime("%Y")

In [201]:
new_new_format

0    2021
1    2021
2    2020
3    2021
4    2020
5    2020
6    2020
Name: Sale_Date, dtype: object

In [211]:
super_merge['Sale_Date'] = new_new_format

In [231]:
super_merge.groupby(['Sale_Date', 'Product_Name']).count()['Product_ID']

Sale_Date  Product_Name
2020       Pixel 5         2
           Samsung S21     1
           iPhone 12       1
2021       Samsung S21     1
           iPhone 12       2
Name: Product_ID, dtype: int64

● Show in a new Dataframe how many licenses sold for each company from each product

In [234]:
sales = pd.read_csv('/Users/mcrandom/Downloads/Sales_Funnel_CRM.csv')

In [ ]:
sales.pivot(index='Company', columns='Product', values='Licenses')

● Show in a new Dataframe for each company what is the total amount of sale price and licences sold

In [255]:
sales.groupby('Company').sum()[['Licenses', 'Sale Price']]

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000